In [55]:
import pandas as pd
import numpy as np

In [7]:
s = pd.Series(list('abcdef'))
s

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [8]:
t = pd.Series([2, 4, 6, 8])
t

0    2
1    4
2    6
3    8
dtype: int64

In [9]:
s = pd.Series([2, 4, 6, 8], index = ['f', 'a', 'c', 'e'])

In [10]:
s['a']

4

In [11]:
s[['a', 'c']]

a    4
c    6
dtype: int64

In [12]:
s2 = pd.Series(range(4), index= list('abab'))

In [13]:
s2

a    0
b    1
a    2
b    3
dtype: int64

In [14]:
s['a']

4

In [15]:
s2['a']

a    0
a    2
dtype: int64

In [17]:
s[s>4]

c    6
e    8
dtype: int64

In [18]:
s>4

f    False
a    False
c     True
e     True
dtype: bool

In [19]:
s*2

f     4
a     8
c    12
e    16
dtype: int64

In [20]:
sdata = {'b': 100, 'c': 150, 'd': 200}

In [22]:
s = pd.Series(sdata)
s

b    100
c    150
d    200
dtype: int64

In [28]:
s = pd.Series(sdata, list('abcd'))
s

a      NaN
b    100.0
c    150.0
d    200.0
dtype: float64

In [26]:
s2 = pd.Series([1, 2, 3], index = ['c', 'b', 'a'])
s2

c    1
b    2
a    3
dtype: int64

In [29]:
s

a      NaN
b    100.0
c    150.0
d    200.0
dtype: float64

In [30]:
s*s2

a      NaN
b    200.0
c    150.0
d      NaN
dtype: float64

In [31]:
data = {'state': ['FL', 'FL', 'GA', 'GA', 'GA'],
        'year': [2010, 2011, 2008, 2010, 2011],
        'pop': [18.8, 19.1, 9.7, 9.7, 9.8]}

In [32]:
frame = pd.DataFrame(data)

In [33]:
frame

    pop state  year
0  18.8    FL  2010
1  19.1    FL  2011
2   9.7    GA  2008
3   9.7    GA  2010
4   9.8    GA  2011

In [34]:
pop_data = {'FL': {2010: 18.8, 2011: 19.1},
            'GA': {2008: 9.7, 2010: 9.7, 2011: 9.8}}

In [35]:
pop = pd.DataFrame(pop_data)

In [36]:
pop

        FL   GA
2008   NaN  9.7
2010  18.8  9.7
2011  19.1  9.8

In [37]:
frame['state']

0    FL
1    FL
2    GA
3    GA
4    GA
Name: state, dtype: object

In [49]:
pop.iloc[0]

FL    NaN
GA    9.7
Name: 2008, dtype: float64

In [51]:
pop.loc[2010]

FL    18.8
GA     9.7
Name: 2010, dtype: float64

In [57]:
frame['other'] = np.nan
frame

    pop state  year  other
0  18.8    FL  2010    NaN
1  19.1    FL  2011    NaN
2   9.7    GA  2008    NaN
3   9.7    GA  2010    NaN
4   9.8    GA  2011    NaN

In [59]:
frame['calc'] = frame['pop'] * 2
frame

    pop state  year  other  calc
0  18.8    FL  2010    NaN  37.6
1  19.1    FL  2011    NaN  38.2
2   9.7    GA  2008    NaN  19.4
3   9.7    GA  2010    NaN  19.4
4   9.8    GA  2011    NaN  19.6

In [61]:
obj = pd.Series(['blue', 'purple', 'red'], index=[0, 2, 4])
obj

0      blue
2    purple
4       red
dtype: object

In [62]:
obj.reindex(range(4))

0      blue
1       NaN
2    purple
3       NaN
dtype: object

In [63]:
obj.reindex(range(5), fill_value='black')

0      blue
1     black
2    purple
3     black
4       red
dtype: object

In [65]:
obj.reindex(range(5), method='ffill')

0      blue
1      blue
2    purple
3    purple
4       red
dtype: object

In [66]:
obj.reindex(range(5), method='bfill')

0      blue
1    purple
2    purple
3       red
4       red
dtype: object

In [68]:
obj.reindex(range(5), method='nearest')

0      blue
1    purple
2    purple
3       red
4       red
dtype: object

In [69]:
pop.sum()

FL    37.9
GA    29.2
dtype: float64

In [70]:
pop.mean()

FL    18.950000
GA     9.733333
dtype: float64

In [71]:
pop.describe()

              FL        GA
count   2.000000  3.000000
mean   18.950000  9.733333
std     0.212132  0.057735
min    18.800000  9.700000
25%    18.875000  9.700000
50%    18.950000  9.700000
75%    19.025000  9.750000
max    19.100000  9.800000

In [72]:
pop < 9.8

         FL     GA
2008  False   True
2010  False   True
2011  False  False

In [75]:
pop[pop < 9.8] = 0
pop

        FL   GA
2008   NaN  0.0
2010  18.8  0.0
2011  19.1  9.8

In [76]:
mcars = pd.read_csv('http://bit.ly/2mVbMR4')

In [77]:
mcars

,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2
5,Valiant,18.1,6,225.0,105,2.76,3.460,20.22,1,0,3,1
6,Duster 360,14.3,8,360.0,245,3.21,3.570,15.84,0,0,3,4
7,Merc 240D,24.4,4,146.7,62,3.69,3.190,20.00,1,0,4,2
8,Merc 230,22.8,4,140.8,95,3.92,3.150,22.90,1,0,4,2
9,Merc 280,19.2,6,167.6,123,3.92,3.440,18.30,1,0,4,4
10,Merc 280C,17.8,6,167.6,123,3.92,3.440,18.90,1,0,4,4
11,Merc 450SE,16.4,8,275.8,180,3.07,4.070,17.40,0,0,3,3
12,Merc 450SL,17.3,8,275.8,180,3.07,3.730,17.60,0,0,3,3
13,Merc 450SLC,15.2,8,275.8,180,3.07,3.780,18.00,0,0,3,3
14,Cadillac Fleetwood,10.4,8,472.0,205,2.93,5.250,17.98,0,0,3,4
15,Lincoln Continental,10.4,8,460.0,215,3.00,5.424,17.82,0,0,3,4
16,Chrysler Imperial,14.7,8,440.0,230,3.23,5.345,17.42,0,0,3,4
17,Fiat 128,32.4,4,78.7,66,4.08,2.200,19.47,1,1,4,1
18,Honda Civic,30.4,4,75.7,52,4.93,1.615,18.52,1,1,4,2
19,Toyota Corolla,33.9,4,71.1,65,4.22,1.835,19.90,1,1,4,1
20,Toyota Corona,21.5,4,120.1,97,3.70,2.465,20.01,1,0,3,1
21,Dodge Challenger,15.5,8,318.0,150,2.76,3.520,16.87,0,0,3,2
22,AMC Javelin,15.2,8,304.0,150,3.15,3.435,17.30,0,0,3,2
23,Camaro Z28,13.3,8,350.0,245,3.73,3.840,15.41,0,0,3,4
24,Pontiac Firebird,19.2,8,400.0,175,3.08,3.845,17.05,0,0,3,2
25,Fiat X1-9,27.3,4,79.0,66,4.08,1.935,18.90,1,1,4,1
26,Porsche 914-2,26.0,4,120.3,91,4.43,2.140,16.70,0,1,5,2
27,Lotus Europa,30.4,4,95.1,113,3.77,1.513,16.90,1,1,5,2
28,Ford Pantera L,15.8,8,351.0,264,4.22,3.170,14.50,0,1,5,4
29,Ferrari Dino,19.7,6,145.0,175,3.62,2.770,15.50,0,1,5,6
30,Maserati Bora,15.0,8,301.0,335,3.54,3.570,14.60,0,1,5,8
31,Volvo 142E,21.4,4,121.0,109,4.11,2.780,18.60,1,1,4,2

In [81]:
pd.crosstab(mcars.gear, columns=[mcars.cyl, mcars.carb])

cyl   4     6        8
carb  1  2  1  4  6  2  3  4  8
gear
3     1  0  2  0  0  4  3  5  0
4     4  4  0  4  0  0  0  0  0
5     0  2  0  0  1  0  0  1  1